core/src/main/resources/order_template/ALU-IN-Query.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:imp="http://implementation.web.api.icc.services.osp.in.alcatel.com" xmlns:xsd="http://pojo.web.api.icc.services.osp.in.alcatel.com/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <imp:getAll>
         <imp:subscriberLineId>
            <xsd:serviceRetailerName>{1}</xsd:serviceRetailerName>
            <xsd:subscriberLineId>{0}</xsd:subscriberLineId>
            <xsd:subscriberLineIdType>3</xsd:subscriberLineIdType>
         </imp:subscriberLineId>
      </imp:getAll>
   </soapenv:Body>
</soapenv:Envelope>